#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/ relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/learn-terraform-github-actions/learn-terraform-github-actions/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/learn-terraform-github-actions/learn-terraform-github-actions

To view this run in a browser, visit:
https://app.terraform.io/app/Jithin-org/jithin-github-actions/runs/run-duDHogGonBGZvZqU

Waiting for the plan to start...

Terraform v1.5.0
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=selected-panther]
module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-0715900f3ba9f48c6]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0ae90dc8cceaebce0]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-066fccb2ac61df597]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0c6882f21d8c7e158]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-02678517a75935aa7]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0d292596a03498390]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-082b37004803c1dcd]
module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0dc4af13f37b0c4d1]
module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0cf933ba980cc835c]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-08625560b70343164]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-089e153358c3d816a]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-04c9930f912d547eb]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0a8c282550afddd931080289494]
module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-02cd08191bc179531]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0ca8e8bb912beb07e]
module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-07b0d2033e69fc299]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e351cd4331e74600]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0d07b70fb20ca41cf]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0aabc349a0b9904c1]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0e3c3719293b8e144]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0cf66d327ac2da75b]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-087e2209daa4afaea]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-03fe68b692bfeb2f5]
aws_security_group.web-sg: Refreshing state... [id=sg-03a92ddba97e8cabb]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0a8c282550afddd93]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-04d68a01e2a763321]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-018603bb07e03fb6e]
module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0a97ce6c21843dfbf]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0354dcbef35e5e5e6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                                  = "ami-09e67e426f25ce0d7"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-018603bb07e03fb6e"
      + tags_all                             = (known after apply)
      + tenancy                              = (known after apply)
      + user_data                            = "ed7927a32f8ee56cbd3d25125f7269575b99e97e"
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-03a92ddba97e8cabb",
        ]
    }

  # module.vpc.aws_default_network_acl.this[0] will be destroyed
  # (because aws_default_network_acl.this is not in configuration)
  - resource "aws_default_network_acl" "this" {
      - arn                    = "arn:aws:ec2:us-east-1:505725425283:network-acl/acl-0d292596a03498390" -> null
      - default_network_acl_id = "acl-0d292596a03498390" -> null
      - id                     = "acl-0d292596a03498390" -> null
      - owner_id               = "505725425283" -> null
      - subnet_ids             = [
          - "subnet-018603bb07e03fb6e",
          - "subnet-03fe68b692bfeb2f5",
          - "subnet-066fccb2ac61df597",
          - "subnet-0ae90dc8cceaebce0",
          - "subnet-0d07b70fb20ca41cf",
          - "subnet-0e351cd4331e74600",
        ] -> null
      - tags                   = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-02678517a75935aa7" -> null

      - egress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - icmp_code       = 0 -> null
          - icmp_type       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      - egress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - icmp_code  = 0 -> null
          - icmp_type  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }

      - ingress {
          - action          = "allow" -> null
          - from_port       = 0 -> null
          - icmp_code       = 0 -> null
          - icmp_type       = 0 -> null
          - ipv6_cidr_block = "::/0" -> null
          - protocol        = "-1" -> null
          - rule_no         = 101 -> null
          - to_port         = 0 -> null
        }
      - ingress {
          - action     = "allow" -> null
          - cidr_block = "0.0.0.0/0" -> null
          - from_port  = 0 -> null
          - icmp_code  = 0 -> null
          - icmp_type  = 0 -> null
          - protocol   = "-1" -> null
          - rule_no    = 100 -> null
          - to_port    = 0 -> null
        }
    }

  # module.vpc.aws_default_route_table.default[0] will be destroyed
  # (because aws_default_route_table.default is not in configuration)
  - resource "aws_default_route_table" "default" {
      - arn                    = "arn:aws:ec2:us-east-1:505725425283:route-table/rtb-0354dcbef35e5e5e6" -> null
      - default_route_table_id = "rtb-0354dcbef35e5e5e6" -> null
      - id                     = "rtb-0354dcbef35e5e5e6" -> null
      - owner_id               = "505725425283" -> null
      - propagating_vgws       = [] -> null
      - route                  = [] -> null
      - tags                   = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-02678517a75935aa7" -> null

      - timeouts {
          - create = "5m" -> null
          - update = "5m" -> null
        }
    }

  # module.vpc.aws_default_security_group.this[0] will be destroyed
  # (because aws_default_security_group.this is not in configuration)
  - resource "aws_default_security_group" "this" {
      - arn                    = "arn:aws:ec2:us-east-1:505725425283:security-group/sg-04d68a01e2a763321" -> null
      - description            = "default VPC security group" -> null
      - egress                 = [] -> null
      - id                     = "sg-04d68a01e2a763321" -> null
      - ingress                = [] -> null
      - name                   = "default" -> null
      - owner_id               = "505725425283" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - tags_all               = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-default"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                 = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_eip.nat[0] will be destroyed
  # (because aws_eip.nat is not in configuration)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0c6882f21d8c7e158" -> null
      - association_id       = "eipassoc-0d9b8d0cce60199c4" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0c6882f21d8c7e158" -> null
      - network_border_group = "us-east-1" -> null
      - network_interface    = "eni-04034181ebde61350" -> null
      - private_dns          = "ip-10-0-101-85.ec2.internal" -> null
      - private_ip           = "10.0.101.85" -> null
      - public_dns           = "ec2-3-211-193-223.compute-1.amazonaws.com" -> null
      - public_ip            = "3.211.193.223" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_eip.nat[1] will be destroyed
  # (because aws_eip.nat is not in configuration)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-0dc4af13f37b0c4d1" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-0dc4af13f37b0c4d1" -> null
      - network_border_group = "us-east-1" -> null
      - public_dns           = "ec2-52-23-41-108.compute-1.amazonaws.com" -> null
      - public_ip            = "52.23.41.108" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_eip.nat[2] will be destroyed
  # (because aws_eip.nat is not in configuration)
  - resource "aws_eip" "nat" {
      - allocation_id        = "eipalloc-02cd08191bc179531" -> null
      - association_id       = "eipassoc-028a85e758eaedeef" -> null
      - domain               = "vpc" -> null
      - id                   = "eipalloc-02cd08191bc179531" -> null
      - network_border_group = "us-east-1" -> null
      - network_interface    = "eni-0973bff4492b2385a" -> null
      - private_dns          = "ip-10-0-103-190.ec2.internal" -> null
      - private_ip           = "10.0.103.190" -> null
      - public_dns           = "ec2-23-22-10-253.compute-1.amazonaws.com" -> null
      - public_ip            = "23.22.10.253" -> null
      - public_ipv4_pool     = "amazon" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc                  = true -> null
    }

  # module.vpc.aws_internet_gateway.this[0] will be destroyed
  # (because aws_internet_gateway.this is not in configuration)
  - resource "aws_internet_gateway" "this" {
      - arn      = "arn:aws:ec2:us-east-1:505725425283:internet-gateway/igw-0ca8e8bb912beb07e" -> null
      - id       = "igw-0ca8e8bb912beb07e" -> null
      - owner_id = "505725425283" -> null
      - tags     = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
      - vpc_id   = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_nat_gateway.this[0] will be destroyed
  # (because aws_nat_gateway.this is not in configuration)
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-0c6882f21d8c7e158" -> null
      - association_id       = "eipassoc-0d9b8d0cce60199c4" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-082b37004803c1dcd" -> null
      - network_interface_id = "eni-04034181ebde61350" -> null
      - private_ip           = "10.0.101.85" -> null
      - public_ip            = "3.211.193.223" -> null
      - subnet_id            = "subnet-03fe68b692bfeb2f5" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1a"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_nat_gateway.this[2] will be destroyed
  # (because aws_nat_gateway.this is not in configuration)
  - resource "aws_nat_gateway" "this" {
      - allocation_id        = "eipalloc-02cd08191bc179531" -> null
      - association_id       = "eipassoc-028a85e758eaedeef" -> null
      - connectivity_type    = "public" -> null
      - id                   = "nat-07b0d2033e69fc299" -> null
      - network_interface_id = "eni-0973bff4492b2385a" -> null
      - private_ip           = "10.0.103.190" -> null
      - public_ip            = "23.22.10.253" -> null
      - subnet_id            = "subnet-066fccb2ac61df597" -> null
      - tags                 = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-us-east-1c"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be destroyed
  # (because aws_route.public_internet_gateway is not in configuration)
  - resource "aws_route" "public_internet_gateway" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - gateway_id             = "igw-0ca8e8bb912beb07e" -> null
      - id                     = "r-rtb-0a8c282550afddd931080289494" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0a8c282550afddd93" -> null
      - state                  = "active" -> null

      - timeouts {
          - create = "5m" -> null
        }
    }

  # module.vpc.aws_route_table.private[0] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:505725425283:route-table/rtb-08625560b70343164" -> null
      - id               = "rtb-08625560b70343164" -> null
      - owner_id         = "505725425283" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_route_table.private[1] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:505725425283:route-table/rtb-0a97ce6c21843dfbf" -> null
      - id               = "rtb-0a97ce6c21843dfbf" -> null
      - owner_id         = "505725425283" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_route_table.private[2] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-1:505725425283:route-table/rtb-0715900f3ba9f48c6" -> null
      - id               = "rtb-0715900f3ba9f48c6" -> null
      - owner_id         = "505725425283" -> null
      - propagating_vgws = [] -> null
      - route            = [] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_route_table.public[0] will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-1:505725425283:route-table/rtb-0a8c282550afddd93" -> null
      - id               = "rtb-0a8c282550afddd93" -> null
      - owner_id         = "505725425283" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-0ca8e8bb912beb07e"
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public"
          - "Terraform"   = "true"
        } -> null
      - tags_all         = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public"
          - "Terraform"   = "true"
        } -> null
      - vpc_id           = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_route_table_association.private[0] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-04c9930f912d547eb" -> null
      - route_table_id = "rtb-08625560b70343164" -> null
      - subnet_id      = "subnet-0ae90dc8cceaebce0" -> null
    }

  # module.vpc.aws_route_table_association.private[1] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-089e153358c3d816a" -> null
      - route_table_id = "rtb-0a97ce6c21843dfbf" -> null
      - subnet_id      = "subnet-0e351cd4331e74600" -> null
    }

  # module.vpc.aws_route_table_association.private[2] will be destroyed
  # (because aws_route_table_association.private is not in configuration)
  - resource "aws_route_table_association" "private" {
      - id             = "rtbassoc-0e3c3719293b8e144" -> null
      - route_table_id = "rtb-0715900f3ba9f48c6" -> null
      - subnet_id      = "subnet-0d07b70fb20ca41cf" -> null
    }

  # module.vpc.aws_route_table_association.public[0] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0aabc349a0b9904c1" -> null
      - route_table_id = "rtb-0a8c282550afddd93" -> null
      - subnet_id      = "subnet-03fe68b692bfeb2f5" -> null
    }

  # module.vpc.aws_route_table_association.public[1] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-087e2209daa4afaea" -> null
      - route_table_id = "rtb-0a8c282550afddd93" -> null
      - subnet_id      = "subnet-018603bb07e03fb6e" -> null
    }

  # module.vpc.aws_route_table_association.public[2] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0cf66d327ac2da75b" -> null
      - route_table_id = "rtb-0a8c282550afddd93" -> null
      - subnet_id      = "subnet-066fccb2ac61df597" -> null
    }

  # module.vpc.aws_subnet.private[0] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:505725425283:subnet/subnet-0ae90dc8cceaebce0" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.1.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0ae90dc8cceaebce0" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "505725425283" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_subnet.private[1] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:505725425283:subnet/subnet-0e351cd4331e74600" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.2.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0e351cd4331e74600" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "505725425283" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_subnet.private[2] will be destroyed
  # (because aws_subnet.private is not in configuration)
  - resource "aws_subnet" "private" {
      - arn                                            = "arn:aws:ec2:us-east-1:505725425283:subnet/subnet-0d07b70fb20ca41cf" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.3.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0d07b70fb20ca41cf" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "505725425283" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-private-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_subnet.public[0] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:505725425283:subnet/subnet-03fe68b692bfeb2f5" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1a" -> null
      - availability_zone_id                           = "use1-az6" -> null
      - cidr_block                                     = "10.0.101.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-03fe68b692bfeb2f5" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "505725425283" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-us-east-1a"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_subnet.public[1] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:505725425283:subnet/subnet-018603bb07e03fb6e" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1b" -> null
      - availability_zone_id                           = "use1-az1" -> null
      - cidr_block                                     = "10.0.102.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-018603bb07e03fb6e" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "505725425283" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-us-east-1b"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_subnet.public[2] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-1:505725425283:subnet/subnet-066fccb2ac61df597" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-1c" -> null
      - availability_zone_id                           = "use1-az2" -> null
      - cidr_block                                     = "10.0.103.0/24" -> null
      - enable_dns64                                   = false -> null
      - enable_lni_at_device_index                     = 0 -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-066fccb2ac61df597" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "505725425283" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - tags_all                                       = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc-public-us-east-1c"
          - "Terraform"   = "true"
        } -> null
      - vpc_id                                         = "vpc-02678517a75935aa7" -> null
    }

  # module.vpc.aws_vpc.this[0] will be destroyed
  # (because aws_vpc.this is not in configuration)
  - resource "aws_vpc" "this" {
      - arn                                  = "arn:aws:ec2:us-east-1:505725425283:vpc/vpc-02678517a75935aa7" -> null
      - assign_generated_ipv6_cidr_block     = false -> null
      - cidr_block                           = "10.0.0.0/16" -> null
      - default_network_acl_id               = "acl-0d292596a03498390" -> null
      - default_route_table_id               = "rtb-0354dcbef35e5e5e6" -> null
      - default_security_group_id            = "sg-04d68a01e2a763321" -> null
      - dhcp_options_id                      = "dopt-0cc0b3c20c87a3f1e" -> null
      - enable_dns_hostnames                 = true -> null
      - enable_dns_support                   = true -> null
      - enable_network_address_usage_metrics = false -> null
      - id                                   = "vpc-02678517a75935aa7" -> null
      - instance_tenancy                     = "default" -> null
      - ipv6_netmask_length                  = 0 -> null
      - main_route_table_id                  = "rtb-0354dcbef35e5e5e6" -> null
      - owner_id                             = "505725425283" -> null
      - tags                                 = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all                             = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
    }

  # module.vpc.aws_vpn_gateway.this[0] will be destroyed
  # (because aws_vpn_gateway.this is not in configuration)
  - resource "aws_vpn_gateway" "this" {
      - amazon_side_asn = "64512" -> null
      - arn             = "arn:aws:ec2:us-east-1:505725425283:vpn-gateway/vgw-0cf933ba980cc835c" -> null
      - id              = "vgw-0cf933ba980cc835c" -> null
      - tags            = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
      - tags_all        = {
          - "Environment" = "dev"
          - "Name"        = "my-vpc"
          - "Terraform"   = "true"
        } -> null
      - vpc_id          = "vpc-02678517a75935aa7" -> null
    }

Plan: 1 to add, 0 to change, 28 to destroy.

Changes to Outputs:
  - vpc_id      = "vpc-02678517a75935aa7" -> null
  + web-address = (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 1 estimated
           $8.352/mo +$8.352

```

</details>

*Pusher: @jithinpnjm, Action: `pull_request`*